Tekla Open API Reference for Tekla Structures 2025
BooleanConverter Methods
The BooleanConverter type exposes the following members.
Methods
Name | Description
CanConvertFrom
 Checks whether the conversion can be made from the source type to the boolean type.
 (Overrides TypeConverter.CanConvertFrom(ITypeDescriptorContext, Type).)
CanConvertTo
 Checks whether the conversion can be made from the boolean type to the destination type.
 (Overrides TypeConverter.CanConvertTo(ITypeDescriptorContext, Type).)
ConvertFrom
 Converts an object from the given culture to the boolean type.
 (Overrides TypeConverter.ConvertFrom(ITypeDescriptorContext, CultureInfo, Object).)
ConvertTo
 Converts an object from the boolean type to the given destination type.
 (Overrides TypeConverter.ConvertTo(ITypeDescriptorContext, CultureInfo, Object, Type).)
Top
See Also
Reference
BooleanConverter Class
Tekla.Structures.Datatype Namespace